cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/versions'
#tap 'puma/puma'
tap 'd12frosted/emacs-plus'
tap 'neovim/neovim'
# tap 'rogual/neovim-dot-app'

# brew 'ack' # grep for programmers
brew 'vim'
brew 'coreutils'
brew 'go' # Golang
brew 'grc' # Colourize logs
# brew 'imagemagick'
brew 'jp2a' # JPG to ASCII
brew 'jq' # sed for JSON
# brew 'libcaca', args: ['with-imlib2'] # libcaca is a graphics library that outputs text instead of pixels
# brew 'libgit2' # libgit2 is a portable, pure C implementation of the Git core methods 
brew 'openssl'
brew 'node'
brew 'readline' # Readline library provides a set of functions for use by applications that allow users to edit command lines as they are typed in
# brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
# brew 'roundup' # Spray roundup on your shells to eliminate weeds and bugs. If your shells survive roundup's deathly toxic properties, they are considered roundup-ready.
# brew 'spaceman-diff' # diff images from the command line
# brew 'spark' # sparklines for your shell (draw bars with input numbers)
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'fd'
brew 'bat'
brew 'xsv'
# brew 'youtube-dl'

# tvhung83 packages
brew 'autoconf'
brew 'automake'
brew 'hub'
brew 'nvm'
brew 'mysql'
brew 'postgresql'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'tree'
brew 'the_silver_searcher'
#brew 'fasd' # already integrated to zim module
brew 'emacs-plus'
brew 'heroku'
brew 'htop'
brew 'neofetch'
brew 'lnav'
# brew 'neovim-dot-app'

# cask '1password'
# cask 'adium' # Adium is a free instant messaging application
# cask 'atom'
# cask 'firefox'
# cask 'garmin-express' # Garmin Express is software that helps you manage your Garmin devices. (Maps)
# cask 'handbrake' # The open source video transcoder
# cask 'mapbox-studio' # Design custom maps that fit seamlessly in your application.
# cask 'seashore' # Seashore is an open source image editor for Mac OS X's Cocoa framework. It features gradients, textures and anti-aliasing for both text and brush strokes
# cask 'steam'
# cask 'transmission'
# cask 'tunnelbear' # TunnelBear VPN

# QuickLook extensions
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'qlvideo'
# cask 'pandoc'

# tvhung83 apps
cask 'java'
cask 'iterm2'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'postman'
cask 'sequel-pro'
# cask 'postico'
# cask 'shuttle' # SSH connection management
# cask 'kaleidoscope'
cask 'docker'
cask 'launchbar'
# cask 'slack'
cask 'zoomus'
cask 'google-chrome'
cask 'gyazo'
cask 'skype'
cask 'the-unarchiver'
# cask 'smcfancontrol'
cask 'skitch'
# cask 'transmit'
cask 'appcleaner'
# cask 'vlc'
cask 'intellij-idea-ce'
# cask 'microsoft-office'
cask 'kap'
# cask 'sblack'
cask 'istat-menus'
cask 'iina'
